Autodesk.Revit.DB.Analysis.gbXMLExportComplexity
This enumeration specifies the level of detail of the exported analytical energy model in gbXML.
Complex means that Curtain Walls and Curtain Systems are exported as several openings, panel by panel;
a curtain wall with 50 panels gets exported as 50 openings. Simple means that one "huge" opening with
the total opening area equal to the 50 panels is exported. This is more appropriate for most energy analysis.
Mullions mean that Mullions in Curtain Walls and Systems are exported as shading surfaces. A "simplified"
analytical shading surface is produced from a mullion based on its centerline, thickness and offset.
Since:
2011

Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.ComplexWithMullionsAndShadingSurfaces
Using this enumeration, mullions will be exported as shading
surfaces. A "simplified" analytical shading surface is produced
from a mullion based on its centerline, thickness and offset.

Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.ComplexWithShadingSurfaces
Using this enumeration, shading surfaces will be produced from
room bounding building elements that are not bounding spaces.

Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.Complex
Using this enumeration, Curtain Walls and Curtain Systems will
exported as several openings, panel by panel.

Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.SimpleWithShadingSurfaces
Using this enumeration, shading surfaces will be produced from
room bounding building elements that are not bounding spaces

Autodesk.Revit.DB.Analysis.gbXMLExportComplexity.Simple
Curtain Walls and Curtain Systems are normally exported as several openings, panel by panel,
while for energy analysis all you need is one giant window. A curtain wall with 50 panels
gets exported as 50 openings, while 1 opening with the total opening area would be more appropriate.
Using this enumeration, one "large" window/opening will be exported for a curtain wall/system